from .models import Country, City

def seed_travel_countries_and_cities():
    if Country.objects.count() == 0:
        data = {
            "일본": ["도쿄", "오사카", "후쿠오카", "삿포로", "오키나와", "교토", "나고야"],
            "베트남": ["다낭", "나트랑", "하노이", "호치민", "푸꾸옥", "사파"],
            "태국": ["방콕", "치앙마이", "푸켓", "파타야", "코사무이"],
            "미국": ["뉴욕", "로스앤젤레스", "샌프란시스코", "하와이", "시애틀", "시카고", "라스베이거스"],
            "필리핀": ["세부", "보라카이", "마닐라", "보홀", "클락"],
            "대만": ["타이베이", "가오슝", "타이중", "화롄", "타이난"],
            "괌": ["괌"],
            "싱가포르": ["싱가포르"],
            "홍콩": ["홍콩"],
            "이탈리아": ["로마", "피렌체", "베네치아", "밀라노", "나폴리", "아말피"],
            "프랑스": ["파리", "니스", "리옹", "마르세유", "스트라스부르"],
            "스페인": ["바르셀로나", "마드리드", "세비야", "그라나다", "말라가"],
            "영국": ["런던", "에든버러", "맨체스터", "리버풀", "옥스퍼드"],
            "스위스": ["인터라켄", "취리히", "제네바", "루체른", "체르마트"],
            "독일": ["뮌헨", "베를린", "프랑크푸르트", "함부르크", "쾰른"],
            "말레이시아": ["쿠알라룸푸르", "코타키나발루", "페낭", "랑카위", "쿠칭"],
            "호주": ["시드니", "멜버른", "브리즈번", "케언즈", "골드코스트"],
            "캐나다": ["밴쿠버", "토론토", "몬트리올", "퀘벡", "밴프"],
            "중국": ["상하이", "베이징", "청두", "칭다오", "장자제"],
            "인도네시아": ["발리", "자카르타", "롬복", "족자카르타", "수라바야"],
            "뉴질랜드": ["오클랜드", "퀸스타운", "크라이스트처치", "웰링턴", "로토루아"],
            "오스트리아": ["빈", "잘츠부르크", "인스브루크", "할슈타트", "그라츠"],
            "체코": ["프라하", "체스키크룸로프", "브르노", "카를로비바리", "플젠"],
            "크로아티아": ["자그레브", "두브로브니크", "스플리트", "플리트비체", "자다르"],
            "튀르키예": ["이스탄불", "카파도키아", "안탈리아", "파묵칼레", "이즈미르"],
            "그리스": ["아테네", "산토리니", "미코노스", "크레타", "로도스"],
            "마카오": ["마카오"],
            "몽골": ["울란바토르", "테를지", "홉스골", "고비사막", "카라코룸"],
            "멕시코": ["칸쿤", "멕시코시티", "과달라하라", "몬테레이", "오아하카"],
            "사이판": ["사이판"]
        }
        for country_name, cities_list in data.items():
            country, created = Country.objects.get_or_create(name=country_name)
            for city_name in cities_list:
                City.objects.get_or_create(country=country, name=city_name)
